In [135]:
#Analyzing the IMDB datasets
import pandas as pd
import numpy as np
df_name_basics=pd.read_csv('/Users/Vasile/Desktop/audible project/dataset/name.basics.tsv', sep ='\t')

In [ ]:
df_name_basics.info()

In [138]:
df_name_basics.shape

(8922083, 6)

In [139]:
df_title_akas =pd.read_csv('/Users/Vasile/Desktop/audible project/dataset/title.akas.tsv', sep ='\t')

In [140]:
df_title_akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0
1,tt0000001,2,Карменсита,RU,\N,\N,\N,0
2,tt0000001,3,Carmencita,US,\N,\N,\N,0
3,tt0000001,4,Carmencita,\N,\N,original,\N,1
4,tt0000002,1,Le clown et ses chiens,\N,\N,original,\N,1

In [141]:
df_title_basics =pd.read_csv('/Users/Vasile/Desktop/audible project/dataset/title.basics.tsv', sep ='\t')

In [142]:
df_title_basics.shape

(5357613, 9)

In [143]:
df_title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,\N,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [25]:
df_title_basics.shape

(5357613, 9)

In [144]:
df_title_ratings =pd.read_csv('/Users/Vasile/Desktop/audible project/dataset/title.ratings.tsv', sep ='\t')

In [145]:
df_title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.8      1427
1  tt0000002            6.4       169
2  tt0000003            6.6      1025
3  tt0000004            6.4       101
4  tt0000005            6.2      1721

In [146]:
df_title_ratings.shape

(878201, 3)

In [167]:
# Perform a inner joint between title_basics and title_ratings to merge the two datasets
df_basics_ratings=pd.merge(df_title_basics, df_title_ratings, on='tconst',
          how='inner')

In [148]:
df_basics_ratings.shape

(878201, 11)

In [149]:
df_basics_ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 878201 entries, 0 to 878200
Data columns (total 11 columns):
tconst            878201 non-null object
titleType         878201 non-null object
primaryTitle      878201 non-null object
originalTitle     878201 non-null object
isAdult           878201 non-null int64
startYear         878201 non-null object
endYear           878201 non-null object
runtimeMinutes    878201 non-null object
genres            878201 non-null object
averageRating     878201 non-null float64
numVotes          878201 non-null int64
dtypes: float64(1), int64(2), object(8)
memory usage: 80.4+ MB

In [150]:
df_title_crew =pd.read_csv('/Users/Vasile/Desktop/audible project/dataset/title.crew.tsv', sep ='\t')

In [151]:
df_title_crew.head()

      tconst  directors writers
0  tt0000001  nm0005690      \N
1  tt0000002  nm0721526      \N
2  tt0000003  nm0721526      \N
3  tt0000004  nm0721526      \N
4  tt0000005  nm0005690      \N

In [152]:
df_title_crew.shape

(5357613, 3)

In [168]:
# perform a inner joint between the previous merged datasets and the title_crew
df_basics_ratings_crew=pd.merge(df_basics_ratings, df_title_crew, on='tconst',
          how='inner')

In [154]:
df_basics_ratings_crew.shape

(878201, 13)

In [155]:
df_title_principals=pd.read_csv('/Users/Vasile/Desktop/audible project/dataset/title.principals.tsv', sep ='\t')

In [156]:
df_title_principals.head()

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,\N,"[""Herself""]"
1,tt0000001,2,nm0005690,director,\N,\N
2,tt0000001,3,nm0374658,cinematographer,director of photography,\N
3,tt0000002,1,nm0721526,director,\N,\N
4,tt0000002,2,nm1335271,composer,\N,\N

In [157]:
df_title_principals.shape

(30486558, 6)

In [158]:
df_basics_ratings_crew.tail()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,averageRating,numVotes,directors,writers
878196,tt9164958,short,Soluk (The Breath),Soluk (The Breath),0,2017,\N,\N,"Sci-Fi,Short",5.4,12,nm10065321,"nm10065321,nm8612741"
878197,tt9168202,short,Soldatskaya skazka,Soldatskaya skazka,0,1980,\N,15,"Animation,Short",7.0,5,nm5019071,nm8762533
878198,tt9169974,movie,Nakee 2,Nakee 2,0,2018,\N,93,"Fantasy,Romance",7.9,12,nm1033529,\N
878199,tt9170584,tvSeries,"Gordon, Gino & Fred's Road Trip","Gordon, Gino & Fred's Road Trip",0,2018,\N,45,"Adventure,Comedy,Reality-TV",7.7,7,nm2337790,\N
878200,tt9175700,short,"Tishe, babushka spit!","Tishe, babushka spit!",0,2012,\N,13,"Animation,Short",7.0,5,nm2203246,nm2203246

In [ ]:
# the dataset title.akas.tsv contains the information about titles
# the dataset title.episode.tsv contains the information about tv series 
# title.principals.tsv contains the information about the pricipal cast crew for titles
# name.basics.tsv contains the information for names 
# all of them are not so important for our problem from the feature engineering perspective
# they are left out of our analysis
# the movies without ratings, that is our target feature, are also left out since this is what we want to predict 

# I used the information only from three datasets title_basics, title_crew, title_ratings

In [159]:
# MISSING VALUES 
# count the number of missing values
print df_basics_ratings_crew[df_basics_ratings_crew=="\N"].count()

tconst                 0
titleType              0
primaryTitle           0
originalTitle          3
isAdult                0
startYear             95
endYear           860381
runtimeMinutes    241764
genres             26625
averageRating          0
numVotes               0
directors         117862
writers           185558
dtype: int64

In [170]:
df_basics_ratings_crew[['startYear', 'runtimeMinutes', 'genres', 'directors', 'writers']]= \
df_basics_ratings_crew[['startYear', 'runtimeMinutes', 'genres', 'directors', 'writers']].replace("\N", np.NaN)

In [171]:
# save the intermediate results in a csv file
df_basics_ratings_crew.to_csv('IMDB_best', sep='\t')